# 结合input,字典,if判断,做一个查询流行语含义的电子词典程序
slang_dict = {"抽象力":"用荒诞、解构式的幽默（如魔性表情包、无厘头文学）来消解生活压力，是年轻人保护精神状态的“缓冲带”。",
              "痛文化":"原指二次元圈展示周边（如痛包）的爱好，现已破圈融入日常穿搭、出行，成为一种张扬热爱的社交名片。"}
slang_dict["主体性"] = "强调“做自己人生的作者”，跳出社会预设剧本，关注自我感受与内在秩序的重建。"
slang_dict["活人感"] = "倦精修滤镜和模板化内容，追求真实、鲜活、有温度的生命力，比如 Live 图里被风吹乱的发丝。"
slang_dict["边界感"] = "在社交和家庭关系中强调分寸与舒适距离，守护个人的心理领地。"
slang_dict["反精致"] = "拒绝过度包装和标准化审美，转而拥抱真实、瑕疵与个性。"
slang_dict["AI人格"] = "将 AI 视为脑洞搭子或“第二自我”，形成一种人机共生的新型伙伴关系。"
slang_dict["柔软力"] = "一种“外柔内韧”的生活智慧，指用更弹性、温柔的方式面对压力。"
slang_dict["代入感"] = "内容能让人迅速沉浸其中，比如通过宠物视角或第一视角叙事来体验不同人生。"
slang_dict["文化力"] = "文化符号或地方叙事带来的传播力，成为日常的情感锚点。"

query = input("请输入您要查询的流行语：")
if query in slang_dict:
    print("您查询的" + query + "含义如下")
    print(slang_dict[query])
else:
    print("您查询的流行语暂未收录。")
    print("当前本字典收录词条数为：" + str(len(slang_dict)) + "条。")